       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCISE_SEARCH.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-TABLE.
           05 MAJORS.
               10 FILLER PIC X(014) VALUE "1234ACCOUNTING".
               10 FILLER PIC X(014) VALUE "2458E.D.P.".
               10 FILLER PIC X(014) VALUE "4999MARKETING".
               10 FILLER PIC X(014) VALUE "1400BIOLOGY".
               10 FILLER PIC X(014) VALUE "1976CHEMISTRY".
               10 FILLER PIC X(014) VALUE "2100CIVIL ENG.".
               10 FILLER PIC X(014) VALUE "3245ECONOMICS".
               10 FILLER PIC X(014) VALUE "5400STATISTICS".
               10 FILLER PIC X(014) VALUE "3960FINANCE".
               10 FILLER PIC X(014) VALUE "4321MANAGEMENT".
           05  MAJOR-VALUE REDEFINES MAJORS
               OCCURS 10 TIMES INDEXED BY WS-MAJOR-IDX.
               10 STR-STATE PIC X(4).
               10 STR-NAME  PIC X(10).
       01  WS-JOB-CODE    PIC X(4).


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "GIVE ME THE JOB CODE".
           ACCEPT WS-JOB-CODE.
           IF  (WS-JOB-CODE NUMERIC)
               PERFORM SEARCH-TABLE
           ELSE
               DISPLAY "INVALID INPUT"
           END-IF
           STOP RUN.

       SEARCH-TABLE.
           SEARCH MAJOR-VALUE
               AT END
                   DISPLAY "JOB CODE NOT FOUND"
               WHEN WS-JOB-CODE = STR-STATE(WS-MAJOR-IDX)
                   DISPLAY "JOB CODE FOUND: " STR-NAME(WS-MAJOR-IDX)
           END-SEARCH.


       END PROGRAM EXERCISE_SEARCH.
